[
  {
    "team": "Canavan Atlantic",
    "location": "Donegal: Alpha Innovation",
    "lat": 54.95587914212807,
    "lng": -7.730537837679118,
    "theme": "CleanTech",
    "county": "Donegal",
    "project": "We are building Canavan Atlantic,  an AI-powered platform \nto speed up Environmental Impact Assessments for \nrenewable energy projects. By automating report drafting, \npolicy lookup, and constraint mapping, we help developers \nand consultants cut delays, reduce costs, and unlock clean \nenergy faster.",
    "outcome": "Delivering a working prototype that shows AI can meaningfully \nspeed up the EIA process, for example, auto-drafting a section, \nmapping constraints, or surfacing policies in seconds. Beyond the \nsprint, success means validating market demand and laying \nfoundations for a scalable, revenue-generating product.",
    "contact_name": "Cressida Canavan",
    "contact_email": "cressidacanavan@gmail.com",
    "likes": 0
  },
  {
    "team": "Cassan Earth",
    "location": "Donegal: Alpha Innovation",
    "lat": 54.95962906048011,
    "lng": -7.739565903628556,
    "theme": "CleanTech",
    "county": "Donegal",
    "project": "Cassan Earth uses agentic AI and satellite data to \nautomatically measure, verify, and bundle blue carbon \nprojects . By estimating carbon stock, sequestration, and \nclimate risks, it turns fragmented restoration sites into \ncredible, compliant portfolios—making nature-based solutions \ntransparent, investable, and scalable.",
    "outcome": "We will prove that agentic AI can automatically generate reliable \ncarbon estimates and risk assessments from satellite data. This \nenables fragmented blue carbon projects to be bundled into \ntrusted, investable portfolios—lowering MRV costs, unlocking \nfinance, and demonstrating a scalable pathway for transparent, \ntechnology-backed nature-based solutions.",
    "contact_name": "Emer Shovlin",
    "contact_email": "emershovlin@gmail.com",
    "likes": 0
  },
  {
    "team": "LibertyLumens",
    "location": "Galway: Portershed",
    "lat": 53.2707,
    "lng": -9.0568,
    "theme": "CleanTech",
    "county": "Galway",
    "project": "Home Power Management AI Agent:  AI agent to analyze \nhome energy use and optimize smart device management for \nefficiency.",
    "outcome": "Measurable reduction in household electricity consumption and \ncosts, improved load balancing during peak hours, and enhanced \nuser satisfaction, as demonstrated by outperforming the baseline \nmetrics from the DBEREL02 dataset following deployment of the \nHome Power Management AI Agent.",
    "contact_name": "Manan Mehta",
    "contact_email": "mehtamanan0@gmail.com",
    "likes": 0
  },
  {
    "team": "LaunchLoop",
    "location": "Dublin: WorkIQ",
    "lat": 53.34532077637154,
    "lng": -6.25837129848527,
    "theme": "Education",
    "county": "Dublin",
    "project": "Intelligent exam correction platform for Irish Leaving \nCertificate papers . Combines advanced AI with human \noversight to tackle examiner shortages causing result delays. \nFeatures bias detection, multi-subject evaluation, and audit \ntrails. Aims to process results 75% faster while ensuring \nfairness and supporting Ireland's €100k SEC research \ninitiative.",
    "outcome": "Reducing Leaving Cert result processing time by 75%, achieving \n95%+ accuracy compared to human examiners, and gaining SEC \napproval for pilot testing. Demonstrate bias-free grading across all \nsubjects, maintain student trust through transparency, and provide \nactionable insights that improve Ireland's education system \noutcomes.\"",
    "contact_name": "Kevin Collins",
    "contact_email": "kevin@lumahue.com",
    "likes": 0
  },
  {
    "team": "AIMA",
    "location": "Dublin: Enterprise Ireland",
    "lat": 53.35326604642349,
    "lng": -6.25758920636009,
    "theme": "Enterprise",
    "county": "Dublin",
    "project": "Factories lose 30% of their revenue because quality mistakes \nare caught after the damage is done. We solve this by \nputting AI where it matters- at the point of assembly  - \ncreating a living model of what is “correct”, spotting errors \ninstantly, and guiding people to fix them instantly.",
    "outcome": "Demonstrate that the problem is real, urgent, and big enough and \nprovide evidence-based market research. We will have a \ngo-to-market roadmap with defined metrics and KPIs. Finally, there \nwill have a live demonstration showing how agentic AI is applied to \nour scalable, monetizable solution.",
    "contact_name": "Asem Mohammad",
    "contact_email": "asem@aimaopex.co.uk",
    "likes": 0
  },
  {
    "team": "JuntoAI",
    "location": "Cork: Republic of Work",
    "lat": 51.8985,
    "lng": -8.4756,
    "theme": "Enterprise",
    "county": "Cork",
    "project": "JuntoAI is a social action network where every \nprofessional gets a personal AI agent . Instead of passive \nscrolling, your agent actively collaborates with others to find \nhires, generate leads, and secure partnerships. It's a network \ndesigned not for engagement, but for tangible, automated \nbusiness",
    "outcome": "Winning the AI Challenge by delivering a compelling \nproof-of-concept that demonstrates the JuntoAI vision. We will \nleverage this momentum for a ProductHunt beta launch, with the \nprimary goal of validating market demand by securing over 500 \nhigh-quality sign-ups for our waitlist to seed our private beta.",
    "contact_name": "Markus Schmidberger",
    "contact_email": "markus@ppa.guide",
    "likes": 0
  },
  {
    "team": "MyCareerVerse",
    "location": "Dublin: Workday",
    "lat": 53.346123233169436,
    "lng": -6.225433119971385,
    "theme": "Enterprise",
    "county": "Dublin",
    "project": "MyCareerVerse  uses AI to match students’ skills to \ncorporate needs from an earlier age , shortening the \ntransition into meaningful roles. By aligning education with \nindustry demand, we give job seekers clear pathways and \nhelp employers access future-ready talent, creating a faster, \nsmarter bridge from classroom to career.",
    "outcome": "Delivering measurable ROI: reducing time-to-hire by 30%, lowering \ncost-per-hire by 25%, and improving retention through 40% better \nskill-role alignment. For corporates and job centres, \nMyCareerVerse becomes a cost-saving, talent-optimising engine, \nwhile students gain faster, clearer career pathways — aligning \nworkforce supply with real market demand.",
    "contact_name": "Angela Curran",
    "contact_email": "gomyar@gmail.com",
    "likes": 0
  },
  {
    "team": "DiagnoAI",
    "location": "Dublin: Workday",
    "lat": 53.34305482803934,
    "lng": -6.229944435413469,
    "theme": "HealthTech",
    "county": "Dublin",
    "project": "Real-time AI integration with hospital PACS . Generated \nreports and predefined labels appear in the imaging viewer, \naiding clinicians in annotating various modalities, with a focus \non cancer, prioritizing urgent cases, and helping reduce \ndiagnostic waiting times in Ireland.",
    "outcome": "A fully functional workflow where hospital PACS data is processed \nin real-time, AI-generated reports appear in the viewer in an \nunderstandable way for clinicians, assisting them in interpreting \nand prioritising various imaging modalities efficiently.",
    "contact_name": "Maryam Saeedi",
    "contact_email": "maryam.saeedi33@gmail.com",
    "likes": 0
  },
  {
    "team": "MedicSage",
    "location": "Sligo: AIM Centre",
    "lat": 54.2771457174792,
    "lng": -8.477475988543285,
    "theme": "HealthTech",
    "county": "Sligo",
    "project": "AI-powered healthcare coordination platform addressing \nIreland's fragmented medical system . Multi-agent \narchitecture connects patients, GPs, and specialists through \nintelligent synthesis of medical data. Features emergency \ndetection, symptom tracking, and specialist coordination with \nhuman-in-the-loop verification using GraphRAG technology.",
    "outcome": "Working 4-workflow n8n demonstration with real \npatient-GP-specialist coordination, validated by healthcare \nproviders, measurable improvement in care coordination \nefficiency, successful integration with Irish healthcare standards \n(HealthLink/FHIR), and clear pathway to national deployment \naddressing healthcare fragmentation.",
    "contact_name": "Emanuel Covasa",
    "contact_email": "e.covasa@me.com",
    "likes": 0
  },
  {
    "team": "Nevo",
    "location": "Dublin: Dogpatch Labs",
    "lat": 53.34769058704396,
    "lng": -6.252322011279496,
    "theme": "HealthTech",
    "county": "Dublin",
    "project": "Ensuring that AI agents in healthcare are safe, reliable, \nand transparent.  Monitoring their decisions, detecting risks, \nand preventing errors, tackling the challenge of trust in \nmedical AI. Providing oversight, it protects patients, supports \nclinicians, and ensures AI aligns with ethical, regulatory and \nclinical standards.",
    "outcome": "A prototype monitoring platform for AI-to-AI interactions in \nhealthcare. The platform provides a vendor-neutral, FHIR-native \nsafety layer that tracks AI system outputs across autonomous \nworkflows, detecting disagreements, drift, inconsistencies, and \npotential cascade errors in real time, and presents them on a \ndashboard. By surfacing these issues early, it enables clinicians, IT \nteams, and AI-enabled device manufacturers to identify and \naddress problems in a timely manner.",
    "contact_name": "Louise McKiernan",
    "contact_email": "louisemckiernan2012@gmail.com",
    "likes": 0
  },
  {
    "team": "Team TCS",
    "location": "Donegal: Alpha Innovation",
    "lat": 54.95133057247964,
    "lng": -7.730989366551514,
    "theme": "HealthTech",
    "county": "Donegal",
    "project": "Accessible Web Browser",
    "outcome": "Create a web browser which take Accessibility guidelines in \naccount and work for people with Visual and Motor disabilities. \nBrower using help of AI would render html keeping needs of \naccessibility in mind.",
    "contact_name": "Mercy Suresh",
    "contact_email": "s.palagiri@tcs.com",
    "likes": 0
  },
  {
    "team": "Deloitte Digital",
    "location": "Dublin: Dogpatch Labs",
    "lat": 53.34896507591373,
    "lng": -6.2434826945507815,
    "theme": "Language",
    "county": "Dublin",
    "project": "An AI Agent that helps people navigate government \nservices by explaining eligibility in plain language, supporting \nmultiple languages, and adapting to personal circumstances \nor policy changes. In two weeks, we will demonstrate a \nworking prototype that reduces confusion and showcases the \npotential of AI assistance in the public sector.",
    "outcome": "A functional prototype that can answer common questions, guide \nusers through eligibility checks, and adapt to basic scenario \nchanges in real time. If people leave the demo with greater clarity \nand confidence about accessing services, and a vision of what the \nfuture of government services could look like, we will have shown \nmeaningful potential for wider application.",
    "contact_name": "Ian Kelleher",
    "contact_email": "ikelleher@deloitte.ie",
    "likes": 0
  },
  {
    "team": "Glór AI",
    "location": "Dublin: The Guinness Enterprise Centre",
    "lat": 53.3441,
    "lng": -6.2675,
    "theme": "Language",
    "county": "Dublin",
    "project": "An AI voicebot that speaks As Gaeilge  - preparing students \nfor orals, allowing natives to engage in pop culture and \npromoting our National Language to be spoken!",
    "outcome": "A live, reliable Irish-learning copilot demoed at Hub Day: <3s \nlatency, ≥80% helpful ratings, syllabus-aligned voice+glossary. Top \nselection/make showcase, and 2-3 school pilot LOIs. 500+ waitlist, \nclear pricing, and reusable voice/glossary modules integrated into \napplications for post-challenge rollout and white labelling.",
    "contact_name": "Gavin Doyle",
    "contact_email": "doyle.d.gavin@gmail.com",
    "likes": 0
  },
  {
    "team": "HandSpeak AI",
    "location": "Sligo: AIM Centre",
    "lat": 54.2799309711243,
    "lng": -8.473296489295414,
    "theme": "Language",
    "county": "Sligo",
    "project": "This innovative AI tackles the challenge of accessibility by \ntransforming speech into clean transcripts and animating \nthem into sign language through FBX models . It solves \ncommunication barriers for the deaf and hard-of-hearing \ncommunity while offering strong educational value by \nteaching sign language through dynamic, interactive, and \nAI-driven visualisation.",
    "outcome": "A seamless web/mobile app or browser extension that turns \nspoken words into precise text and expressive sign language \nanimations, empowering the deaf and hard-of-hearing to \ncommunicate more freely while also serving as an engaging, \nAI-powered platform for learning and practicing sign language.",
    "contact_name": "Michael Creamer",
    "contact_email": "ewoodward@beyond.com",
    "likes": 0
  },
  {
    "team": "ICØN",
    "location": "Galway: Portershed",
    "lat": 53.27275825527227,
    "lng": -9.059788654750166,
    "theme": "MediaTech",
    "county": "Galway",
    "project": "ICØN is the world’s first certified platform for AI identity \n— enabling creators, sports athletes, and high-profile \ncelebrities to verify, protect, and monetise AI clones of \ntheir voice, face, and persona . With legal IP rights, Clone \nAccess Tokens, and fan monetisation tools, ICØN powers \ntrusted identity in the age of AI.",
    "outcome": "A full end-to-end showcase: onboarding a high-profile client via \nKYC and rights verification, creating their AI clone, securing it in \nthe ICØN Digital Vault, and activating a licensed, monetised \nsubscriber experience — delivering a complete, real-world beta of \nthe certified AI identity platform.",
    "contact_name": "Raj Lyons",
    "contact_email": "raj@affinityev.com",
    "likes": 0
  }
]
